/*
 Navicat MySQL Data Transfer

 Source Server         : local
 Source Server Version : 50625
 Source Host           : localhost
 Source Database       : med

 Target Server Version : 50625
 File Encoding         : utf-8

 Date: 07/06/2015 13:49:50 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `comp_info`
-- ----------------------------
DROP TABLE IF EXISTS `comp_info`;
CREATE TABLE `comp_info` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `shortname` varchar(255) DEFAULT NULL,
  `pingying` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `telephone` varchar(255) DEFAULT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  `zipcode` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `create_date` datetime DEFAULT NULL,
  `status` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `comp_good_map`
-- ----------------------------

DROP TABLE IF EXISTS `comp_good_map`;
CREATE TABLE `comp_good_map` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `comp_id` int(11) NOT NULL,
  `good_id` int(11) NOT NULL,
  `price` int(11) NOT NULL DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `good_info`
-- ----------------------------
DROP TABLE IF EXISTS `good_info`;
CREATE TABLE `good_info` (
  `good_id` int(11) NOT NULL,
  `good_name` varchar(255) NOT NULL,
  `good_tyname` varchar(255) DEFAULT NULL,
  `good_gg` varchar(255) DEFAULT NULL,
  `good_dw` varchar(255) DEFAULT NULL,
  `good_cp` varchar(255) DEFAULT NULL,
  `good_pzwh` varchar(255) NOT NULL,
  `good_dbzsl` int(11) DEFAULT NULL,
  `good_jx` varchar(255) DEFAULT NULL,
  `good_lsj` varchar(255) DEFAULT NULL,
  `good_pfj` varchar(255) DEFAULT NULL,
  `good_py` varchar(255) DEFAULT NULL,
  `good_xsj` varchar(255) DEFAULT NULL,
  `good_tm` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`good_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `good_info`
-- ----------------------------
BEGIN;
INSERT INTO `good_info` VALUES ('1000002', '(依尔欣)盐酸普萘洛尔片', 'R', '24片', '盒', '大同市卫华药业', '国药准字H14021703', '400', '片剂', '1.000000', '9.500000', '(yex)yspllep', '1.000000', '6933176400128'), ('1000003', '(为消)乳酸菌素片', '', '0.4g*60片', '盒', '哈药集团制药六厂', '国药准字H19993935', '200', '片剂', '1.000000', '7.000000', '(WX)RSJSP', '1.000000', '6900572060478'), ('1000004', '(多多)乳酸菌素片', 'S', '60片', '盒', '多多药业有限公司', '国药准字H23021622', '200', '片剂', '1.000000', '2.800000', '(dd)rsjsp', '1.000000', '6921650164093'), ('1000005', '(怡瑞)西沙必利片', 'P', '5mg*10片', '盒', '浙江京新药业股份有限公司', '国药准字H20020345', '400', '片剂', '1.000000', '3.500000', 'YR)XSBLP', '1.000000', '6910853815017'), ('1000006', '(吗丁啉)多潘立酮片', '', '10mg*30片', '盒', '西安杨森制药有限公司', '国药准字H10910003', '450', '片剂', '1.000000', '14.500000', '(mdl)dpltp', '1.000000', '6922154600087'), ('1000007', '枫蓼肠胃康片', 'S', '12片*2板', '盒', '海南万州绿色制药有限公司', '国药准字Z19993354', '400', '片剂', '1.000000', '4.000000', 'FLCWKP', '1.000000', '6932179815984'), ('1000008', '乳酸菌素片', '', '12片*5板', '袋', '云南白药集团丽江药业有限公司', '国药准字H53021429', '400', '片剂', '1.000000', '1.500000', 'RSJSP', '1.000000', '6940777520100'), ('1000009', '(牙周宁片)糠甾醇片', 'x', '100片', '瓶', '四川大冢制药有限公司', '国药准字H33021987', '400', '片剂', '1.000000', '1.400000', 'YZNP)KZCP', '1.000000', '*'), ('1000010', '(乐得胃片)鼠李铋镁片', 'S', '120片', '盒', '广东省岭南制药厂', '国药准字H44024832', '400', '片剂', '1.000000', '7.600000', 'LDWP)SLBMP', '1.000000', '6932345823454'), ('1000011', '盐酸二甲双胍片', 'P', '0.25g*48片', '瓶', '北京中惠药业有限公司', '国药准字H19983069', '300', '片剂', '1.000000', '2.000000', 'YSEJSGP', '1.000000', '6941586200016'), ('1000012', '菌白敏片', '', '0.3g*24片', '盒', '成都地奥集团天府药业有限公司', '国药准字Z20025737', '400', '片剂', '1.000000', '4.300000', 'JBMP', '1.000000', '6920040530036'), ('1000013', '盐酸苯乙双胍片', '盐酸苯乙双胍片', '25mg*100片', '瓶', '山东省莒南制药厂', '国药准字H37021531', '600', '片剂', '1.000000', '1.600000', 'YSBYSGP', '1.000000', ''), ('1000014', '(达喜)铝碳酸镁片', 'S', '0.5g*20片', '盒', '拜耳医药保健有限公司', '国药准字H20013410', '300', '片剂', '1.000000', '27.200000', '(DX)LTSMP', '1.000000', '6924147603020'), ('1000015', '枫蓼肠胃康片', 'S', '12片*3板', '盒', '海口市制药厂有限公司', '国药准字Z20003404', '300', '片剂', '1.000000', '5.300000', 'FLCWKP', '1.000000', '6903283400083'), ('1000016', '(消炎痛)吲哚美辛肠溶片', 'R', '25mg*100片', '瓶', '重庆科瑞制药有限责任公司', '国药准字H50020263', '240', '片剂', '1.000000', '1.500000', '(XYT)YDMXCRP', '1.000000', ''), ('1000017', '(东宝甘泰)复方蛋氨酸胆碱片', '', '12片*4板', '盒', '通化东宝药业股份有限公司', '国药准字H22024764', '180', '片剂', '1.000000', '19.800000', '(DBGT)FFDASDJP', '1.000000', '6901891868820'), ('1000018', '藿香清胃片', 'S', '12片', '盒', '广州市花城制药厂', '国药准字Z44020161', '400', '片剂', '1.000000', '5.500000', 'HXQWP', '1.000000', '6927771400690'), ('1000019', '溴丙胺太林片', 'P', '15mg*100片', '瓶', '重庆科瑞制药有限责任公司', '国药准字H50020645', '240', '片剂', '1.000000', '5.500000', 'xbatlp', '1.000000', '6919320100755'), ('1000020', '(胡庆余堂)胃复春片', '', '0.36g*60片', '瓶', '杭州胡庆余堂药业有限公司', '国药准字Z20040003', '120', '片剂', '1.000000', '16.900000', '(hqyt)wfcp', '1.000000', '6903087831069'), ('1000021', '(米雅)口服酪酸梭菌活菌片', 'S', '20片', '盒', '日本米雅利桑制药株式会社', '进口药品注册证：S20090075', '400', '片剂', '1.000000', '26.500000', 'MY)KFLSSJHJP', '1.000000', ''), ('1000022', '硫糖铝咀嚼片(硫糖铝片)', 'S', '0.25g*100片', '瓶', '重庆科瑞制药有限责任公司', '国药准字H50020310', '120', '片剂', '1.000000', '2.500000', 'ltljjp(ltlp)', '1.000000', ''), ('1000023', '铋镁豆蔻片', 'S', '12片*2板', '盒', '山西亚宝药业集团股份有限公司', '国药准字H14023533', '400', '片剂', '1.000000', '3.000000', 'BMDKP', '1.000000', '6916107516921'), ('1000024', '肠胃宁片', '', '0.3g*15片*3板', '盒', '云南省腾冲县东方红制药有限责任公司', '国药准字Z53021222', '240', '片剂', '1.000000', '14.000000', 'CWNP', '1.000000', '6928017120242'), ('1000025', '(胃舒平)复方氢氧化铝片', 'S', '100片', '瓶', '重庆科瑞制药有限责任公司', '国药准字H50020239', '120', '片剂', '1.000000', '2.200000', '(wsp)ffqyhlp', '1.000000', ''), ('1000026', '肌苷片', '', '0.2g*100片', '瓶', '广州白云山制药股份有限公司', '国药准字H44023203', '200', '片剂', '1.000000', '4.500000', 'JGP', '1.000000', '6902401043225'), ('1000027', '(丽珠维三联)组合包装', 'S', '8片', '盒', '丽珠集团丽珠制药厂', '国药准字H10900084', '280', '片剂', '1.000000', '24.500000', '(lzwsl)zhbz', '1.000000', '6903286101284'), ('1000028', '枫蓼肠胃康片', 'S', '12片*2板', '盒', '海口市制药厂有限公司', '国药准字Z20003404', '400', '片剂', '1.000000', '4.000000', 'FLCWKP', '1.000000', '6903283400076'), ('1000030', '盐酸二甲双胍片', 'P', '0.25g*12片*4板', '盒', '重庆科瑞制药有限责任公司', '国药准字H50020322', '400', '片剂', '1.000000', '2.800000', 'YSEJSGP', '1.000000', '6919320100915'), ('1000031', '盐酸乙胺丁醇片', '', '0.25g*100片', '瓶', '成都锦华药业有限责任公司', '国药准字H51020917', '100', '片剂', '1.000000', '14.500000', 'YSYADCP', '1.000000', '6934859401050'), ('1000032', '格列吡嗪片', '', '5mg*30片', '盒', '深圳南方盈信制药有限公司', '国药准字H20023414', '400', '片剂', '1.000000', '6.000000', 'GLBQP', '1.000000', '6926146613888'), ('1000033', '盐酸小檗碱片(盐酸黄连素片)', 'S', '0.1g*100片', '瓶', '成都锦华药业有限责任公司', '国药准字H51022193', '400', '片剂', '1.000000', '3.600000', 'ysxbjp(yshlsp)', '1.000000', '6934859405010'), ('1000034', '呋喃妥因肠溶片', 'S', '100片', '瓶', '西南药业股份有限公司', '国药准字H50020160', '400', '片剂', '1.000000', '1.500000', 'FNTYCRP', '1.000000', '*'), ('1000035', '盐酸二甲双胍片', '', '0.25g*48片', '瓶', '北京嘉德制药有限公司', '国药准字H19983070', '400', '片剂', '1.000000', '1.800000', 'YSEJSGP', '1.000000', ''), ('1000036', '消炎利胆片(简)', 'G', '100片', '瓶', '广东省博罗先锋药业集团有限公司', '国药准字Z20013216', '480', '片剂', '1.000000', '1.200000', 'XYLDP(J)', '1.000000', ''), ('1000037', '参松养心胶囊', 'G', '0.4g*36粒', '盒', '北京以岭药业有限公司', '国药准字Z20103032', '400', '胶囊剂', '1.000000', '25.000000', 'ssyxjn', '1.000000', '6920855082584'), ('1000038', '乳酸菌素片', '', '50片', '袋', '哈药集团制药六厂', '国药准字H19993935', '400', '片剂', '1.000000', '1.100000', 'RSJSP', '1.000000', ''), ('1000039', '(凯西莱)硫普罗宁肠溶片', 'G', '0.1g*12片', '盒', '河南省新谊药业股份有限公司', '国药准字H41020799', '450', '片剂', '1.000000', '22.000000', '(kxl)lplncrp', '1.000000', ''), ('1000040', '苦胆草片', 'Q', '12片/板*2板/盒', '盒', '云南省腾冲制药厂', '国药准字Z53020278', '400', '片剂', '1.000000', '2.400000', 'KDCP', '1.000000', '6928880321111'), ('1000041', '(立克糖)盐酸二甲双胍片', '盐酸二甲双胍片', '0.5g*24片', '盒', '成都川力制药有限公司', '国药准字H51022589', '160', '片剂', '1.000000', '6.500000', '(LKT)YSEJSGP', '1.000000', '6942025400035'), ('1000042', '(消心痛)硝酸异山梨酯片', '', '5mg*100片', '瓶', '山西云鹏制药有限公司', '国药准字H14020799', '600', '片剂', '1.000000', '0.600000', '(XXT)XSYSLZP', '1.000000', ''), ('1000043', '左旋多巴片', 'P', '0.25g*100片', '瓶', '广西河丰药业有限责任公司', '国药准字H45020051', '100', '片剂', '1.000000', '19.000000', 'ZXDBP', '1.000000', '6934759220058'), ('1000045', '(珍欣)盐酸仑氨西林片', '', '0.25g*6s', '盒', '山东鲁抗医药股份有限公司', '国药准字H20040328', '400', '片剂', '1.000000', '35.000000', 'ZX)YSLAXLP', '1.000000', '6903447300990'), ('1000046', '肾炎康复片', 'P', '0.3g*72片', '瓶', '天津同仁堂股份有限公司', '国药准字Z10940029', '400', '片剂', '1.000000', '24.500000', 'SYKFP', '1.000000', '6924144300014'), ('1000047', '(步长)胆石利通片', 'G', '0.45g*54片', '瓶', '山东步长制药有限公司', '国药准字Z10970036', '120', '片剂', '1.000000', '23.500000', '(bc)dsltp', '1.000000', '6927762130155'), ('1000048', '护肝片', 'G', '100片', '瓶', '吉林龙泰制药股份有限公司', '国药准字Z22024425', '400', '片剂', '1.000000', '5.500000', 'HGP', '1.000000', '6927638100145'), ('1000049', '肠舒片', 'S', '0.3g*12片*2板', '盒', '云南雄业制药有限公司', '国药准字Z20025848', '300', '片剂', '1.000000', '14.000000', 'CSP', '1.000000', '6932415920861'), ('1000050', '(降糖灵)盐酸苯乙双胍片', '', '25mg*100片', '瓶', '江苏亚邦爱普森药业有限公司', '国药准字H32023979', '400', '片剂', '1.000000', '1.000000', 'JTL)YSBYSGP', '1.000000', '6934666300355'), ('1000051', '(迪银)复方氨肽素片', 'P', '120片', '瓶', '重庆华邦制药股份有限公司', '国药准字H50021778', '100', '片剂', '1.000000', '42.000000', '(DY)FFATSP', '1.000000', '6920327600636'), ('1000053', '复方益肝灵片', '', '60片', '瓶', '吉林敖东洮南药业股份有限公司', '国药准字Z22021964', '400', '片剂', '1.000000', '16.000000', 'FFYGLP', '1.000000', '6922230569024'), ('1000054', '甲苯磺丁脲片', 'T', '0.5g*100片', '瓶', '江苏鹏鹞药业有限公司', '国药准字H32021009', '100', '片剂', '1.000000', '4.400000', 'JBHDNP', '1.000000', '');
COMMIT;

-- ----------------------------
--  Table structure for `orderdetail`
-- ----------------------------
DROP TABLE IF EXISTS `orderdetail`;
CREATE TABLE `orderdetail` (
  `oid` int(11) NOT NULL AUTO_INCREMENT,
  `order_id` varchar(255) DEFAULT NULL,
  `good_id` int(11) DEFAULT NULL,
  `good_name` varchar(255) NOT NULL,
  `good_gg` varchar(255) DEFAULT NULL,
  `good_dw` varchar(255) DEFAULT NULL,
  `good_cp` varchar(255) DEFAULT NULL,
  `good_pzwh` varchar(255) NOT NULL,
  `good_beizu` varchar(255) DEFAULT NULL,
  `good_lastprice` varchar(255) DEFAULT NULL,
  `good_number` float DEFAULT NULL,
  `good_price` float DEFAULT NULL,
  `good_amount` float DEFAULT NULL,
  PRIMARY KEY (`oid`),
  KEY `FK7D606D1F4FCCF32F` (`order_id`),
  CONSTRAINT `FK7D606D1F4FCCF32F` FOREIGN KEY (`order_id`) REFERENCES `ordermaster` (`order_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `ordermaster`
-- ----------------------------
DROP TABLE IF EXISTS `ordermaster`;
CREATE TABLE `ordermaster` (
  `order_id` varchar(255) NOT NULL,
  `supplie_id` int(11) DEFAULT NULL,
  `order_oper` varchar(255) DEFAULT NULL,
  `order_beizu` varchar(255) DEFAULT NULL,
  `order_date` varchar(255) DEFAULT NULL,
  `order_lastvaiddate` varchar(255) DEFAULT NULL,
  `order_status_record` text DEFAULT NULL COMMENT '订单状态转换的JSON字符串',
  `order_status` int(11) DEFAULT '1',
  `order_type` int(11) NOT NULL DEFAULT 0 COMMENT '0 为直接订单 1为询价订单',
  `comp_id` int(11) NOT NULL,
  PRIMARY KEY (`order_id`),
  KEY `FK8C837F309D12195B` (`comp_id`),
  CONSTRAINT `FK8C837F309D12195B` FOREIGN KEY (`comp_id`) REFERENCES `comp_info` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `role`
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `role_name` varchar(30) NOT NULL,
  PRIMARY KEY (`id`,`role_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `username` varchar(50) NOT NULL,
  `realname` varchar(10) NOT NULL,
  `password` varchar(50) NOT NULL,
  `comp_id` int(11) NOT NULL,
  `role_id` int(11) NOT NULL,
  `tel` varchar(15) DEFAULT NULL,
  `phone` varchar(11) DEFAULT NULL,
  `email` varchar(30) DEFAULT NULL,
  `state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '状态，是否有效   0正常  1停用',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

SET FOREIGN_KEY_CHECKS = 1;
